results/rest/stage-10000/payload-heavy/200VUs/repeat-2/200vus-summary.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./src/rest/restTest.js
        output: json (./results/rest/stage-10000/payload-heavy/200VUs/repeat-2/200vus.json)

     scenarios: (100.00%) 1 scenario, 200 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 200 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 200/200 VUs, 442 complete and 0 interrupted iterations
default   [   2% ] 200 VUs  0m01.0s/1m0s

running (0m02.0s), 200/200 VUs, 1024 complete and 0 interrupted iterations
default   [   3% ] 200 VUs  0m02.0s/1m0s

running (0m03.0s), 200/200 VUs, 1624 complete and 0 interrupted iterations
default   [   5% ] 200 VUs  0m03.0s/1m0s

running (0m04.0s), 200/200 VUs, 2227 complete and 0 interrupted iterations
default   [   7% ] 200 VUs  0m04.0s/1m0s

running (0m05.0s), 200/200 VUs, 2847 complete and 0 interrupted iterations
default   [   8% ] 200 VUs  0m05.0s/1m0s

running (0m06.0s), 200/200 VUs, 3470 complete and 0 interrupted iterations
default   [  10% ] 200 VUs  0m06.0s/1m0s

running (0m07.0s), 200/200 VUs, 4079 complete and 0 interrupted iterations
default   [  12% ] 200 VUs  0m07.0s/1m0s

running (0m07.4s), 200/200 VUs, 4708 complete and 0 interrupted iterations
default   [  13% ] 200 VUs  0m08.0s/1m0s

running (0m08.4s), 200/200 VUs, 5327 complete and 0 interrupted iterations
default   [  15% ] 200 VUs  0m09.0s/1m0s

running (0m09.4s), 200/200 VUs, 5950 complete and 0 interrupted iterations
default   [  17% ] 200 VUs  0m10.0s/1m0s

running (0m10.4s), 200/200 VUs, 6582 complete and 0 interrupted iterations
default   [  18% ] 200 VUs  0m11.0s/1m0s

running (0m11.4s), 200/200 VUs, 7184 complete and 0 interrupted iterations
default   [  20% ] 200 VUs  0m12.0s/1m0s

running (0m12.4s), 200/200 VUs, 7776 complete and 0 interrupted iterations
default   [  22% ] 200 VUs  0m13.0s/1m0s

running (0m13.4s), 200/200 VUs, 8405 complete and 0 interrupted iterations
default   [  23% ] 200 VUs  0m14.0s/1m0s

running (0m14.4s), 200/200 VUs, 9014 complete and 0 interrupted iterations
default   [  25% ] 200 VUs  0m15.0s/1m0s

running (0m15.4s), 200/200 VUs, 9633 complete and 0 interrupted iterations
default   [  27% ] 200 VUs  0m16.0s/1m0s

running (0m16.4s), 200/200 VUs, 10257 complete and 0 interrupted iterations
default   [  28% ] 200 VUs  0m17.0s/1m0s

running (0m17.4s), 200/200 VUs, 10881 complete and 0 interrupted iterations
default   [  30% ] 200 VUs  0m18.0s/1m0s

running (0m18.4s), 200/200 VUs, 11491 complete and 0 interrupted iterations
default   [  32% ] 200 VUs  0m19.0s/1m0s

running (0m19.4s), 200/200 VUs, 12125 complete and 0 interrupted iterations
default   [  33% ] 200 VUs  0m20.0s/1m0s

running (0m20.4s), 200/200 VUs, 12744 complete and 0 interrupted iterations
default   [  35% ] 200 VUs  0m21.0s/1m0s

running (0m21.4s), 200/200 VUs, 13362 complete and 0 interrupted iterations
default   [  37% ] 200 VUs  0m22.0s/1m0s

running (0m21.1s), 200/200 VUs, 13960 complete and 0 interrupted iterations
default   [  38% ] 200 VUs  0m23.0s/1m0s

running (0m22.1s), 200/200 VUs, 14586 complete and 0 interrupted iterations
default   [  40% ] 200 VUs  0m24.0s/1m0s

running (0m23.1s), 200/200 VUs, 15193 complete and 0 interrupted iterations
default   [  42% ] 200 VUs  0m25.0s/1m0s

running (0m24.1s), 200/200 VUs, 15822 complete and 0 interrupted iterations
default   [  43% ] 200 VUs  0m26.0s/1m0s

running (0m25.1s), 200/200 VUs, 16450 complete and 0 interrupted iterations
default   [  45% ] 200 VUs  0m27.0s/1m0s

running (0m26.1s), 200/200 VUs, 17076 complete and 0 interrupted iterations
default   [  47% ] 200 VUs  0m28.0s/1m0s

running (0m27.1s), 200/200 VUs, 17708 complete and 0 interrupted iterations
default   [  48% ] 200 VUs  0m29.0s/1m0s

running (0m28.1s), 200/200 VUs, 18334 complete and 0 interrupted iterations
default   [  50% ] 200 VUs  0m30.0s/1m0s

running (0m29.1s), 200/200 VUs, 18959 complete and 0 interrupted iterations
default   [  52% ] 200 VUs  0m31.0s/1m0s

running (0m30.1s), 200/200 VUs, 19590 complete and 0 interrupted iterations
default   [  53% ] 200 VUs  0m32.0s/1m0s

running (0m31.1s), 200/200 VUs, 20219 complete and 0 interrupted iterations
default   [  55% ] 200 VUs  0m33.0s/1m0s

running (0m32.1s), 200/200 VUs, 20822 complete and 0 interrupted iterations
default   [  57% ] 200 VUs  0m34.0s/1m0s

running (0m33.1s), 200/200 VUs, 21450 complete and 0 interrupted iterations
default   [  58% ] 200 VUs  0m35.0s/1m0s

running (0m34.1s), 200/200 VUs, 22091 complete and 0 interrupted iterations
default   [  60% ] 200 VUs  0m36.0s/1m0s

running (0m35.1s), 200/200 VUs, 22718 complete and 0 interrupted iterations
default   [  62% ] 200 VUs  0m37.0s/1m0s

running (0m35.5s), 200/200 VUs, 23344 complete and 0 interrupted iterations
default   [  63% ] 200 VUs  0m38.0s/1m0s

running (0m36.5s), 200/200 VUs, 23973 complete and 0 interrupted iterations
default   [  65% ] 200 VUs  0m39.0s/1m0s

running (0m37.5s), 200/200 VUs, 24596 complete and 0 interrupted iterations
default   [  67% ] 200 VUs  0m40.0s/1m0s

running (0m38.5s), 200/200 VUs, 25232 complete and 0 interrupted iterations
default   [  68% ] 200 VUs  0m41.0s/1m0s

running (0m39.5s), 200/200 VUs, 25864 complete and 0 interrupted iterations
default   [  70% ] 200 VUs  0m42.0s/1m0s

running (0m40.5s), 200/200 VUs, 26476 complete and 0 interrupted iterations
default   [  72% ] 200 VUs  0m43.0s/1m0s

running (0m41.5s), 200/200 VUs, 27108 complete and 0 interrupted iterations
default   [  73% ] 200 VUs  0m44.0s/1m0s

running (0m42.5s), 200/200 VUs, 27728 complete and 0 interrupted iterations
default   [  75% ] 200 VUs  0m45.0s/1m0s

running (0m43.5s), 200/200 VUs, 28350 complete and 0 interrupted iterations
default   [  77% ] 200 VUs  0m46.0s/1m0s

running (0m44.5s), 200/200 VUs, 28984 complete and 0 interrupted iterations
default   [  78% ] 200 VUs  0m47.0s/1m0s

running (0m45.5s), 200/200 VUs, 29622 complete and 0 interrupted iterations
default   [  80% ] 200 VUs  0m48.0s/1m0s

running (0m46.5s), 200/200 VUs, 30241 complete and 0 interrupted iterations
default   [  82% ] 200 VUs  0m49.0s/1m0s

running (0m47.5s), 200/200 VUs, 30857 complete and 0 interrupted iterations
default   [  83% ] 200 VUs  0m50.0s/1m0s

running (0m48.5s), 200/200 VUs, 31482 complete and 0 interrupted iterations
default   [  85% ] 200 VUs  0m51.0s/1m0s

running (0m49.5s), 200/200 VUs, 32107 complete and 0 interrupted iterations
default   [  87% ] 200 VUs  0m52.0s/1m0s

running (0m50.5s), 200/200 VUs, 32719 complete and 0 interrupted iterations
default   [  88% ] 200 VUs  0m53.0s/1m0s

running (0m51.5s), 200/200 VUs, 33351 complete and 0 interrupted iterations
default   [  90% ] 200 VUs  0m54.0s/1m0s

running (0m52.5s), 200/200 VUs, 33980 complete and 0 interrupted iterations
default   [  92% ] 200 VUs  0m55.0s/1m0s

running (0m53.5s), 200/200 VUs, 34607 complete and 0 interrupted iterations
default   [  93% ] 200 VUs  0m56.0s/1m0s

running (0m54.5s), 200/200 VUs, 35238 complete and 0 interrupted iterations
default   [  95% ] 200 VUs  0m57.0s/1m0s

running (0m55.5s), 200/200 VUs, 35866 complete and 0 interrupted iterations
default   [  97% ] 200 VUs  0m58.0s/1m0s

running (0m56.5s), 200/200 VUs, 36493 complete and 0 interrupted iterations
default   [  98% ] 200 VUs  0m59.0s/1m0s

running (0m57.5s), 200/200 VUs, 37111 complete and 0 interrupted iterations
default   [ 100% ] 200 VUs  1m00.0s/1m0s


  █ TOTAL RESULTS 

    CUSTOM
    benchmark_slow_failure_rate....: 0.06%  24 out of 37323
    benchmark_total_failure_rate...: 0.06%  24 out of 37323

    HTTP
    http_req_duration..............: avg=317.17ms min=63.84µs  med=319.99ms max=1.5s p(90)=332.81ms p(95)=338.01ms
      { expected_response:true }...: avg=317.17ms min=63.84µs  med=319.99ms max=1.5s p(90)=332.81ms p(95)=338.01ms
    http_req_failed................: 0.00%  0 out of 37323
    http_reqs......................: 37323  646.568713/s

    EXECUTION
    iteration_duration.............: avg=322.06ms min=221.59ms med=320.43ms max=1.5s p(90)=333.04ms p(95)=337.89ms
    iterations.....................: 37323  646.568713/s
    vus............................: 200    min=200         max=200
    vus_max........................: 200    min=200         max=200

    NETWORK
    data_received..................: 9.3 MB 161 kB/s
    data_sent......................: 1.2 GB 21 MB/s



running (0m57.7s), 000/200 VUs, 37323 complete and 0 interrupted iterations
default ✓ [ 100% ] 200 VUs  1m0s